<?php

namespace App\Http\Controllers;

use App\Cities;
use Illuminate\Http\Request;
use App\novaPoshta\src\Delivery\NovaPoshtaApi2;
use App\Http\Requests;
use Illuminate\Support\Facades\Lang;

class NovaPoshta extends Controller
{
    public $lang;

    /**
     * CartController constructor.
     */
    public function __construct()
    {
        //$this->middleware('auth');

        $this->lang = Lang::locale();
    }

    public function getDepartments(Request $request)
    {


        $city = $request->city;

        if ($city) {
            $city = Cities::where('city_' . $this->lang, $city)->pluck('city_' . $this->lang)->first();

            $np = new NovaPoshtaApi2(
                'e0b184fb2cadefd70e4993d40bc1efd4',
                $this->lang, // Язык возвращаемых данных: ru (default) | ua | en
                TRUE, // При ошибке в запросе выбрасывать Exception: FALSE (default) | TRUE
                'curl' // Используемый механизм запроса: curl (defalut) | file_get_content
            );

            $result = $np
                ->model('Address')
                ->method('getWarehouses')
                ->params(array(
                    'CityName' => $city,
                ))
                ->execute();


            return response()->json(['Departments' => $result['data'], 'language' => $this->lang, 'status' => 200]);
        }


    }

    public function cities(){

        $cities = "
                    Авангард
                    Авдеевка
                    Авиаторское
                    Агрономичное
                    Аджамка
                    Ананьев
                    Андреевка (Балаклейский р-н)
                    Андреевка (Бердянский р-н)
                    Андрушевка
                    Антоновка (Скадовский р-н)
                    Антонины
                    Апостолово
                    Арбузинка
                    Арциз
                    Аскания-Нова
                    Аулы
                    Бабаи
                    Бабанка
                    Балабино
                    Балаклея (Черкасская обл.)
                    Балаклея (Харьковская обл.)
                    Балки (Запорожская обл.)
                    Балта
                    Банилов
                    Бар
                    Баранинцы (Закарпатская обл.)
                    Барановка
                    Барвенково
                    Барышевка
                    Бахмач
                    Бахмут
                    Баштанка
                    Безлюдовка
                    Бердичев
                    Бердянск
                    Берегово
                    Берегомет
                    Бережаны (Тернопольская обл.)
                    Березанка(Николаевская обл.)
                    Березань
                    Березовка
                    Березна (Черниговская обл.)
                    Березно
                    Березнеговатое
                    Берестечко
                    Берислав (Херсонская обл.)
                    Бершадь
                    Былбасовка
                    Бышев
                    Бобрка
                    Белая
                    Белая Криница (Ровенская обл.)
                    Белая Церковь
                    Белгород-Днестровский
                    Беленькое(Запорожская обл.)
                    Белики
                    Белицкое(Донецкая обл.)
                    Белки
                    Беловодск
                    Белогорье
                    Белогородка
                    Белозерка (Херсонская обл.)
                    Белозёрское (Донецкая обл.)
                    Белозерье
                    Белокуракино
                    Белолуцк
                    Белополье
                    Бильмак (Запорожская обл.)
                    Большовцы
                    Беляевка
                    Благовещенка (Камянско-Днепровский р-н)
                    Благовещенское(Кировоградская обл.)
                    Близнюки
                    Бобринец
                    Бобровица
                    Богдановка (Днепропетровская обл.)
                    Богдановка (Кировоградская обл.)
                    Богодухов
                    Богородчаны
                    Богуслав (Днепропетровская обл.)
                    Богуслав (Киевская обл.)
                    Божедаровка(Криничанский р-н)
                    Болград (Одеская обл.)
                    Болехов
                    Борзна
                    Борислав (Львовская обл.)
                    Борисполь
                    Боровское(Луганська обл.)
                    Боровая (Киевская обл.)
                    Боровая (Харьковская обл.)
                    Бородянка
                    Боромля (Сумская обл.)
                    Борщев
                    Бохоники
                    Бояны
                    Боярка
                    Браилов
                    Братское
                    Брацлав
                    Брилевка
                    Брод
                    Бровары
                    Броды
                    Брошнев-Осада
                    Брусилов
                    Брюховичи
                    Буды (Харьковская обл.)
                    Буки
                    Бурынь
                    Бурштын
                    Буск
                    Буча
                    Бучач
                    Буштыно
                    Валки
                    Вапнярка
                    Вараш
                    Варва
                    Васильевка (Запорожская обл.)
                    Васильков
                    Васильковка (Днепропетровская обл.)
                    Ватутино
                    Вашковцы (Вижницкий р-н)
                    Великая Багачка
                    Великая Березовица
                    Великая Белозерка
                    Великая Виска
                    Великая Дымерка
                    Великая Добронь
                    Великая Знаменка
                    Великая Лепетиха
                    Великая Михайловка
                    Великая Новоселка
                    Великая Александровка (Херсонская обл.)
                    Великая Писаревка
                    Великая Чернетчина
                    Великий Березный
                    Великий Бычков
                    Великий Бурлук
                    Великий Дальник
                    Великий Кучуров
                    Великий Любень
                    Великие Борки
                    Великие Гаи
                    Великие Копани
                    Великие Крынки (Глобинский р-н)
                    Великие Лучки
                    Великие Мосты
                    Великие Сорочинцы
                    Великодолинское
                    Велятин
                    Вендичаны
                    Верба(Ровенская обл.)
                    Верховцево
                    Верхнее Водяное
                    Верхнее Синевидное
                    Верхний Рогачик
                    Верхнеднепровск
                    Верхняя Сироватка
                    Верховина
                    Веселое (Запорожская обл.)
                    Веселиново
                    Выгода (Ивано-Франковская обл)
                    Вижница
                    Вилково
                    Вилок (Закарпатская обл.)
                    Винники
                    Виноградов
                    Выпасное (Белгород-Днестровский р-н)
                    Виры
                    Выришальное (Лохвицкий р-н)
                    Высокий
                    Высокополье
                    Вышгород
                    Вишенки
                    Вышково
                    Вишневое
                    Вишневец
                    Вийтовка
                    Войтовцы (Хмельницкая обл.)
                    Вольне (Криворожский р-н)
                    Вольное(Новомосковский р-н)
                    Вольногорск
                    Вольнянск
                    Вильшана (Черкаская обл.)
                    Ольшана(Сумская обл.)
                    Ольшани (Харьковская обл.)
                    Ольшанка (Кировоградская обл.)
                    Винницкие Хутора
                    Винница
                    Виньковцы
                    Власовка
                    Волчанск
                    Водяное (Каменско-Днепровский р-н)
                    Вознесенск
                    Волноваха
                    Воловец
                    Володарка
                    Владимир-Волынский
                    Владимирец
                    Владимировка (Донецкая обл.)
                    Волочиск
                    Ворзель
                    Ворожба (Белопольский р-н)
                    Воронеж
                    Вороновица
                    Вороньков
                    Ворохта
                    Воскресенское (Николаевская обл.)
                    Врадиевка
                    Угледар
                    Узловое
                    Гавришовка
                    Гадяч
                    Гайворон
                    Гайсин
                    Галич
                    Гвардейское (Днепропетровск)
                    Гвоздец
                    Гельмязов
                    Геническ
                    Геронимовка
                    Герца
                    Горняк
                    Горское
                    Глеваха
                    Глыбокая
                    Глобино
                    Глухов (Сумская обл.)
                    Глуховцы
                    Гнивань
                    Гнездычев
                    Гоголево (Полтавская обл.)
                    Гоголев(Броварской р-н)
                    Голая Пристань
                    Голобы
                    Голованевск
                    Головно
                    Голубовка
                    Гончаровское
                    Горинчово
                    Горишние Плавни
                    Горностаевка
                    Городенка
                    Городец
                    Городище (Черкасская обл.)
                    Городковка
                    Городня
                    Городок(Львовская обл.)
                    Городок(Хмельницкая обл.)
                    Горохов
                    Горького
                    Гоща
                    Градижск
                    Гребенка (Полтавская обл.)
                    Гребенки
                    Григоровка
                    Гримайлов
                    Грицев
                    Гришковцы
                    Губиниха
                    Гуляйполе
                    Гусятин
                    Давыдов
                    Дарьевка
                    Дачное
                    Дашев
                    Двуречная
                    Делятин
                    Демидов
                    Демидовка
                    Деражня
                    Дергачи
                    Десна (Винницкая обл.)
                    Десна (Черниговская обл.)
                    Джулинка (Бершадской р-н)
                    Джурин (Шаргородский р-н)
                    Диканька
                    Дымер
                    Деловое
                    Дмитровка (Знамянский р-н Кировоградская обл.)
                    Дмитровка (Черниговская обл.)
                    Днепр
                    Днепровка (Запорожская обл.)
                    Днепровское
                    Днепрорудное
                    Добровеличковка
                    Добромиль
                    Доброполье
                    Доброслав
                    Добротвор
                    Довбыш
                    Долгое (Закарпатская обл.)
                    Долина
                    Долинская
                    Долинское (Запорожский р-н)
                    Доманевка
                    Донец(Балаклейский р-н)
                    Донское
                    Дорошовка
                    Драбов
                    Драгово
                    Драчинцы
                    Дрогобыч
                    Дружба (Сумська обл.)
                    Дружба (Тернопольская обл.)
                    Дружковка
                    Дубляны (Львов.обл.,Жовков.р-н)
                    Дубно
                    Дубовое
                    Дубровица (Ровенская обл.
                    Дударков
                    Дулибы
                    Дунаевцы
                    Дядьковичи (Ровненский р-н)
                    Энергодар
                    Еланец
                    Елизаветовка
                    Емильчино
                    Ерки
                    Жашков
                    Жеребково
                    Жидачов
                    Житомир
                    Жмеринка
                    Жовква
                    Желтые Воды
                    Журавно
                    Заборье
                    Заболотов (Снятинский р-н)
                    Заболотье (Волынская обл.)
                    Завалье (Кировоград обл.)
                    Заводское(Лохвицкий р-н,Полтав.обл)
                    Заводское(Тернопольская обл.)
                    Зазимье
                    Железный Порт
                    Заложцы
                    Залещики
                    Запытов
                    Запорожье
                    Зарванцы
                    Заречное(Ровенская обл.)
                    Заречье(Закарпатская обл.)
                    Заставна
                    Засулье
                    Затока
                    Захарьевка(Одесская обл)
                    Зачепиловка
                    Збараж
                    Зборов
                    Звенигородка
                    Згуровка
                    Здолбунов
                    Зеленогорское
                    Зеленодольск
                    Зимняя Вода
                    Зеньков
                    Злинка
                    Змиев
                    Змиенец
                    Знаменка (Кировоградская обл.)
                    Знаменка (Одесская обл.)
                    Знамянка Вторая
                    Знаменовка (Новомосковский р-н)
                    Знобь-Новгородское
                    Зняцево
                    Золотоноша
                    Золочев (Львовская обл.)
                    Золочев (Харьковськая обл.)
                    Заря (Ровенская обл.)
                    Иваничи (Волынская обл.)
                    Ивановка (Одессая обл. Ивановський р-н)
                    Ивановка (Херсонская обл.)
                    Иванков (Иванковский р-н)
                    Иванков(Бориспольский р-н)
                    Ивано-Франковск
                    Ивано-Франково
                    Иза
                    Измаил
                    Изюм
                    Изяслав
                    Илларионово
                    Ильичанка
                    Ильинцы
                    Ирклиев
                    Ирпень
                    Иршава
                    Иршанск
                    Испас
                    Ичня
                    Кагарлык
                    Казанка
                    Каланчак
                    Калиновка (Броварской р-н)
                    Калиновка (Винницкая обл., Калиновский р-н)
                    Калиновка(Васильковский район)
                    Калита
                    Калуш
                    Каменец-Подольский
                    Каменка (Черкасская обл.)
                    Каменка (Черновицкая обл. Глыбокский р-н)
                    Каменка-Бугская
                    Каменка-Днепровская (Запорожская обл.)
                    Каменское(Днепропетровская обл)
                    Камень-Каширский
                    Канев
                    Карловка
                    Карнауховка(Днепропетровская обл.)
                    Каролино-Бугаз
                    Карповка (Широковский р-н)
                    Катеринополь
                    Каховка
                    Квасилов (Ровенская обл.)
                    Кегичевка
                    Кельменцы
                    Киев
                    Кириковка(Великописар.р-н)
                    Кирилловка(Акимовский р-н)
                    Кирнасовка
                    Кислица
                    Киверцы
                    Ковшаровка
                    Килия
                    Конецполь
                    Кицмань
                    Клавдиево-Тарасово
                    Клевань
                    Клесов
                    Клишковцы
                    Княжичи (Броварской р-н)
                    Кобеляки
                    Коблево
                    Ковель
                    Кодыма
                    Козацкое (Херсонская обл.)
                    Козачья Лопань
                    Козелец
                    Козельщина
                    Козин (Киевская обл.)
                    Козын (Ровенская обл.)
                    Козова
                    Казатин
                    Колки
                    Колоденка
                    Коломак
                    Коломыя
                    Колочава
                    Комар
                    Комарно
                    Камышаны
                    Камышня
                    Камышеваха
                    Компанеевка
                    Конотоп
                    Копайгород
                    Копашново
                    Копылов
                    Копычинцы (Гусятинский р-н)
                    Корец
                    Корытняны
                    Корнын (Житомирская обл.)
                    Королево
                    Короп
                    Коростень
                    Коростышев
                    Корсунь-Шевченковский
                    Коршев
                    Корюковка
                    Косов
                    Косонь (Косино)
                    Костополь
                    Константиновка (Донецкая обл.)
                    Констянтиновка(Арбузинский р-н, Никол.обл.)
                    Констянтиновка(Мелитоп.р-н,Запорож.обл)
                    Котельва
                    Коцюбинское
                    Краковец
                    Краматорск
                    Красилов
                    Красиловка (Броварской р-н)
                    Красное (Львовская обл.)
                    Красноград (Харьковская обл)
                    Краснокутск
                    Краснопавловка
                    Краснополье (Сумская обл.)
                    Краснореченское
                    Красятичи
                    Кременец
                    Кременчуг
                    Кременная
                    Кривое Озеро
                    Кривой Рог
                    Крыжополь
                    Кринички
                    Кролевец
                    Кропивницкий
                    Крупец
                    Крюковщина
                    Куликов
                    Куликовка
                    Купянск
                    Купянск-Узловой
                    Курахово
                    Куты (Косовский р-н)
                    Кучурган
                    Кушница
                    Ладан
                    Ладыжин
                    Ладыжинка
                    Лазорки (Оржицкий р-н)
                    Лазурное (Херсонская обл.)
                    Лановцы
                    Ланчин
                    Лебедин (Сумская обл.)
                    Лебедин (Черкаская обл., Шполянский р-н)
                    Леськи
                    Летичев
                    Лиман(Донецька обл)
                    Лиманское (Раздельнянский р-н)
                    Липины
                    Липовая Долина
                    Липовец
                    Лысая Гора
                    Лисичанск
                    Лысянка
                    Литин
                    Лешня
                    Лозовая
                    Лозоватка(Криворожский р-н)
                    Локачи
                    Лопатин (Львовская обл.)
                    Лосиновка
                    Лохвица
                    Лубны
                    Лугины
                    Лужаны
                    Лука-Мелешковская
                    Луков
                    Луцк
                    Львов
                    Любар
                    Любашевка
                    Любешов
                    Любимовка (Каховский р-н)
                    Люблинец
                    Любомль
                    Люботин
                    Магдалиновка
                    Майское
                    Макаров
                    Малая Белозерка
                    Малая Виска
                    Малая Даниловка
                    Малехов
                    Малин
                    Малиновка (Харьковская обл.)
                    Мамаевцы
                    Мамалига
                    Мангуш
                    Маневичи
                    Маньковка
                    Марьинка
                    Марьянское
                    Марганец
                    Мариуполь
                    Марковка
                    Матвеевка(Вольнянский р-н)
                    Махнивка (Винницкая обл.)
                    Машевка
                    Медвежье Ушко
                    Меденичи
                    Межевая
                    Мелитополь
                    Мельница-Подольская (Тернопольская обл.)
                    Мена
                    Мерефа
                    Мигово
                    Николаев
                    Николаев (Львовская обл., Николаевский р-н)
                    Николаевка (Одесская обл., Николаевский р-н)
                    Николаевка (Петропавловский р-н)
                    Николаевка (Славянский городской совет)
                    Николаевка(Белопольский р-н)
                    Микулинцы
                    Милая
                    Минай
                    Миргород
                    Мирное(Мелитопол. р-н)
                    Мирноград
                    Мироновка
                    Мирополье(Сумская обл.)
                    Мирополь(Житомирская обл.)
                    Михайловка (Михайловский р-н. Запорожская обл.)
                    Михайловка (Черкаська обл.)
                    Межгорье
                    Мизоч
                    Меловое
                    Мостки (Сватовский р-н)
                    Мешково-Погорелово
                    Млинов
                    Могилев
                    Могилев - Подольский
                    Молодежное
                    Молочанск
                    Монастыриска
                    Монастырище
                    Моршин
                    Мостиска
                    Мошны
                    Мукачево
                    Мурованые Куриловцы
                    Надворная
                    Народичи
                    Недобоивцы
                    Недригайлов (Сумская обл.)
                    Некрасово (Винницкий р-н)
                    Немиров (Винницкая обл.)
                    Немиров (Львовская обл.)
                    Немешаево
                    Неполоковцы
                    Нересница (Тячевский р-н)
                    Нерубайское
                    Нетешин
                    Нехвороща
                    Нещеретово
                    Нива Трудовая
                    Нижанковичи
                    Нижние Ворота
                    Нижние Серогозы
                    Нижние Становци
                    Нижняя Дуванка
                    Нижняя Сыроватка
                    Низы
                    Нежин
                    Никольское
                    Никополь (Днепропетровская обл.)
                    Нисмичи
                    Новая Боровая
                    Новая Водолага
                    Новая Галещина (Козельщенский р-н)
                    Новая Збурьевка
                    Новая Каховка
                    Новая Маячка
                    Новая Одесса
                    Новая Прага
                    Новая Ушица
                    Новгород-Северский
                    Новгородка(Кировоградская обл.)
                    Новгородское (Донецкая обл.)
                    Новое
                    Новый Буг
                    Новый Калинов
                    Новый Роздол
                    Новый Стародуб
                    Новый Ярычев
                    Новые Белокоровичи
                    Новые Петровцы
                    Новые Санжары
                    Новоайдар
                    Новоархангельск
                    Новобогдановка(Запорож.обл.)
                    Нововолынск
                    Нововоронцовка
                    Новоград-Волынский
                    Новогродовка
                    Новогуйвинское
                    Новоднестровск
                    Новодружеск
                    Новониколаевка (Запорожская обл.)
                    Новониколаевка(Скадовский р-н)
                    Новомиргород
                    Новомосковск
                    Новоалександровка (Нововорон.р-н,Херсон.обл.)
                    Новоалександровка (Днепропетровская обл.)
                    Новоалексеевка (Херсонская обл.)
                    Новопавловка(Межевский р-н)
                    Новопокровка (Харьковская обл.)
                    Новопсков
                    Новоселица
                    Новоселки (Киево-Святошинский р-н)
                    Новотроицкое (Донецкая обл.)
                    Новотроицкое (Херсонская обл.)
                    Новоукраинка
                    Новояворовск
                    Носовка
                    Обертин
                    Оболонь (Семеновский р-н)
                    Обухов
                    Обуховка
                    Овидиополь
                    Овруч
                    Одесса
                    Оженин
                    Озерное (Житомирская обл.)
                    Окны
                    Олевск
                    Александровка (Николаевская обл.)
                    Александровка (Александр.р-н,Донец.обл)
                    Александровка (пгт.Кировог.обл.райц)
                    Александрия (г.Кировогр.обл.райц)
                    Александрия (Ровенская обл.)
                    Алексеево-Дружковка
                    Алёшки(Херсонская обл)
                    Ольшанское
                    Оноковцы (ст. Доманинцы)
                    Онуфриевка
                    Опытное (Бахмутский р-н)
                    Опошня
                    Оратов
                    Оржица
                    Оржев
                    Орехов
                    Орловщина
                    Осипенко(Бердянский р-н)
                    Остер
                    Острог
                    Острожец
                    Отыния
                    Ахтырка
                    Очаков
                    Очеретино (Ясиноватский р-н)
                    Пятихатки
                    Павлыш
                    Павлов(Львовская обл.)
                    Павлоград
                    Пантаевка
                    Панютино
                    Парафиевка
                    Партизанское (Днепропетров.р-н)
                    Первомайск(Никол.обл.Первомайс.р-н)
                    Первомайское(пгт-Никол.обл.Витовский.р-н)
                    Первомайский (Харьковская обл.)
                    Перегинское
                    Перемышляны
                    Пересадовка
                    Перечин
                    Перещепино
                    Переяслав-Хмельницкий
                    Першотравенск (Днепропетровская обл)
                    Першотравенск (Житомирская обл.)
                    Петриковка
                    Петровка - Роменская
                    Петровское (Харьковская обл.)
                    Петрово
                    Петропавловка
                    Печенеги
                    Печенежин
                    Пирятин
                    Пивденное (Харьковский обл.)
                    Пивничное
                    Подбуж
                    Подволочиск
                    Подгайцы(Тернопольская обл.)
                    Подгоровка
                    Подгородное
                    Пески-Радьковские
                    Песковка
                    Песочин
                    Песчаная (Одесская обл.)
                    Песчаное ( Полтавская обл.)
                    Песчаное(Черкаская обл.)
                    Песчаный Брод
                    Песчанка (Винницкая обл.)
                    Песчанка(Днепропетровская обл.)
                    Побугское
                    Погребы
                    Погребище
                    Подольск
                    Покотиловка
                    Покров
                    Покровск
                    Покровское
                    Полигон
                    Пологи
                    Полонное
                    Полтава
                    Поляна (Закарпатская обл.)
                    Поляница (Буковель)
                    Помошная
                    Понинка
                    Понорница
                    Попасная
                    Попельня
                    Почаев
                    Преображенка (Каланчацкий р-н)
                    Приазовское
                    Прилуки
                    Приморск (Запорожская обл.)
                    Приютовка (Кировоградская обл.)
                    Пролески
                    Просяная (Покровский р-н)
                    Пулины
                    Пустомыты
                    Путивль
                    Путила
                    Рава-Русская
                    Радехов
                    Радивилов
                    Радомышль
                    Радушное
                    Райгородка
                    Райгородок(Славянский р-н)
                    Райское(Херсонская обл.)
                    Ракошино
                    Ралевка
                    Ратно
                    Рафаловка
                    Рахов
                    Рахны-Лисовые
                    Ременов
                    Рени
                    Решетиловка
                    Ржищев
                    Рыково
                    Ровно
                    Ровное (Новоукраинский р-н, Кировоградская обл.)
                    Репки
                    Рогань(Великая Рогань)
                    Рогатин
                    Родинское
                    Рожище
                    Рожнятов
                    Раздельная (Одесская обл.)
                    Розовка (Розовский р-н)
                    Рассошенцы(Полтавская обл.)
                    Розтоки
                    Ракитное (Киевская обл., Ракитнянский р-н)
                    Рокитное (Ровенская обл., Рокитновский р-н)
                    Романов
                    Романковцы
                    Ромны
                    Ромодан
                    Рубановка
                    Рубежное
                    Рудки
                    Ружин
                    Русская Лозовая
                    Русская Поляна
                    Рясное-Русское
                    Саврань
                    Сагуновка
                    Самбор
                    Сарата
                    Сарны
                    Сартана (Донецкая обл.)
                    Сахновщина
                    Свалява
                    Сватово
                    Свесса
                    Светловодск
                    Светлодарск
                    Святогорск
                    Святопетровское (Киево-Свят. р-н)
                    Селидово
                    Семеновка(Полт.обл.,Семенов.р-н)
                    Семеновка (Черниговская обл.)
                    Сенча
                    Сергеевка (Белгород-Днестровский р-н)
                    Серебрия
                    Середина-Буда
                    Среднее
                    Среднее Водяное
                    Северодонецк
                    Сивашкое
                    Сигнаевка
                    Синельниково
                    Ситковцы
                    Северск
                    Сингуры
                    Скадовск
                    Скала-Подольская
                    Скалат
                    Сквира
                    Сколе
                    Скороходово (Полтавська обл.)
                    Славское(Львовская обл.)
                    Славута
                    Славутич
                    Слатино
                    Слобожанское(Змиёвский р-н., Харьковская обл.)
                    Славянск
                    Словечное
                    Смыга
                    Смела
                    Смолино
                    Снигиревка
                    Сновск
                    Снятин
                    Сокаль
                    Сокирница(Хуст.р-н, Закарпатская обл.)
                    Сокиряны
                    Сокольники
                    Соколовка
                    Соледар
                    Соленое
                    Солоницевка
                    Солонка (Львовская обл.)
                    Солотвино
                    Сосница
                    Сосновка (Львовская обл.)
                    Софиевка(Днепропетровская обл.)
                    Сошично
                    Сребное
                    Ставище
                    Станица Луганская
                    Старая Выжевка
                    Старая Синява
                    Старая Ушица
                    Старый Крым (Донецкая обл.)
                    Старый Острополь
                    Старый Самбор
                    Старобельск
                    Старовойтово
                    Староказачье
                    Староконстантинов
                    Старомлиновка
                    Стаси
                    Стеблев (Черкасская обл.)
                    Стеблёвка
                    Стебник
                    Степановка (Сумская обл.)
                    Степань
                    Стецковка
                    Сторожинец
                    Сторожница(Ужгородский р-н)
                    Стоянов (Львовская обл.)
                    Стоянка
                    Страбичово
                    Стрижавка
                    Стрый
                    Стрелки
                    Струмовка
                    Стуфчинцы
                    Субботцы
                    Судилков
                    Судовая Вишня
                    Сумы
                    Сурско-Литовское
                    Сутиски
                    Сходница
                    Таврийск (Херсонская обл.)
                    Таврийское (Голопристанский р-н)
                    Таирово
                    Талаковка
                    Талалаевка
                    Тальное
                    Тальянки
                    Тарановка
                    Тарасовка
                    Тараща
                    Тарутино
                    Татарбунары
                    Теофиполь
                    Теплик
                    Теплодар
                    Теребовля
                    Тересва
                    Терешки (Полтавский р-н)
                    Терны
                    Терновка
                    Тернополь
                    Терпенье
                    Тетиев
                    Тывров
                    Тинное
                    Тысменица
                    Тишковка
                    Тлумач
                    Толстое
                    Токмак
                    Томаковка
                    Томашгород
                    Томашполь
                    Торецк
                    Торчин
                    Требухов
                    Триполье (Киевская обл.)
                    Троицкое (Луганская обл.)
                    Троицкое (Одес.обл, Беляевский р-н)
                    Тростянец (Винницкая обл.)
                    Тростянец (Сумская обл.)
                    Трускавец
                    Тульчин
                    Турбов
                    Турийск
                    Турка
                    Тучин
                    Тячев
                    Угля
                    Угринов
                    Ужгород
                    Узин
                    Украинка
                    Украинск (Донецкая обл.)
                    Уланов
                    Умань
                    Устилуг
                    Устиновка
                    Фастов
                    Фонтанка
                    Харьков
                    Хацки
                    Херсон
                    Хыров
                    Хмельницкий
                    Хмелевое (Кировоградская обл.)
                    Хмельник (Винницкая обл.)
                    Ходоров
                    Хорол
                    Хоростков
                    Хорошев
                    Хотин
                    Хотов
                    Хотинь
                    Христиновка
                    Хуст
                    Царичанка
                    Цебриково
                    Цекиновка
                    Цибулев
                    Циркуны
                    Цумань
                    Чабаны
                    Чайки
                    Чаплино
                    Чаплинка (Херсонская обл.)
                    Часов Яр
                    Чемеровцы
                    Червоная Каменка
                    Червоная Слобода
                    Червоное (Житомирская обл.)
                    Червоноград (Львовская обл.)
                    Черкассы
                    Черкасское
                    Черновцы
                    Черновцы (Винницкая обл.)
                    Чернигов
                    Черниговка
                    Черниев
                    Чернятин (Жмеринский р-н)
                    Черняхов (Житомирская обл.)
                    Чечельник
                    Чигирин
                    Чинадиево
                    Чкалово (Новотроицкий р-н, Херсонская обл.)
                    Чкаловское
                    Чонгар(Херсонская обл.)
                    Чоп
                    Чорный Остров
                    Чорнобаевка
                    Чернобай
                    Черноморск
                    Чернухи (Полтавская обл.)
                    Чортков
                    Чугуев
                    Чудей
                    Чуднов
                    Чутово
                    Шабо
                    Шаргород (Винницкая обл.)
                    Шацк
                    Шаян
                    Шевченково (Килийский р-н)
                    Шевченково (Харковская обл.)
                    Шевченково (Черкаская обл.)
                    Шегини
                    Шепетовка
                    Шипинцы
                    Широкое (Широковский р-н)
                    Ширяево
                    Шишаки
                    Шостка
                    Шпола
                    Шумск
                    Счастливое
                    Счастье
                    Щирец
                    Южное
                    Южноукраинск
                    Юрьевка
                    Яблонов
                    Яворов
                    Яготин  
                    Акимовка (Запорожская обл.)
                    Якушинци
                    Ялта (Донецкая обл.)
                    Ямполь (Винницкая обл.)
                    Ямполь (Сумская обл.)
                    Ямполь (Хмельницкая обл.)
                    Яремче
                    Яреськи
                    Ярмолинцы
                    Ясенов-Польный
                    Ясиня"
        ;
        $cities_uaq = "
                        Авангард
                        Авдіївка
                        Авіаторське
                        Агрономічне
                        Аджамка
                        Ананьїв
                        Андріївка (Балаклійський р-н)
                        Андріївка (Бердянський р-н)
                        Андрушівка
                        Антонівка (Скадовський р-н)
                        Антоніни
                        Апостолове
                        Арбузинка
                        Арциз
                        Асканія-Нова
                        Аули
                        Бабаї
                        Бабанка
                        Балабине
                        Балаклея (Черкаська обл.)
                        Балаклія (Харківська обл.)
                        Балки (Запорізька обл.)
                        Балта
                        Банилів
                        Бар
                        Баранинці (Закарпатська обл.)
                        Баранівка
                        Барвінкове
                        Баришівка
                        Бахмач
                        Бахмут
                        Баштанка
                        Безлюдівка
                        Бердичів
                        Бердянськ
                        Берегове
                        Берегомет
                        Бережани (Тернопільська обл.)
                        Березанка(Миколаївська обл.)
                        Березань
                        Березівка
                        Березна (Чернігівська обл.)
                        Березне
                        Березнегувате
                        Берестечко
                        Берислав (Херсонська обл.)
                        Бершадь
                        Билбасівка
                        Бишів
                        Бібрка
                        Біла
                        Біла Криниця (Рівненська обл.)
                        Біла Церква
                        Білгород-Дністровський
                        Біленьке(Запорізька обл.)
                        Білики
                        Білицьке(Донецька обл.)
                        Білки
                        Біловодськ
                        Білогір'я
                        Білогородка
                        Білозерка (Херсонська обл.)
                        Білозерське (Донецька обл.)
                        Білозір'я
                        Білокуракине
                        Білолуцьк
                        Білопілля
                        Більмак (Запорізька обл.)
                        Більшівці
                        Біляївка
                        Благовіщенка (Кам'янсько-Дніпровський р-н)
                        Благовіщенське(Кіровоградська обл.)
                        Близнюки
                        Бобринець
                        Бобровиця
                        Богданівка (Дніпропетровська обл.)
                        Богданівка (Кіровоградська обл.)
                        Богодухів
                        Богородчани
                        Богуслав (Дніпропетровська обл.)
                        Богуслав (Київська обл.)
                        Божедарівка(Криничанський р-н)
                        Болград (Одеська обл.)
                        Болехів
                        Борзна
                        Борислав (Львівська обл.)
                        Бориспіль
                        Борівське(Луганська обл.)
                        Борова (Київська обл.)
                        Борова (Харківська обл.)
                        Бородянка
                        Боромля (Сумська обл.)
                        Борщів
                        Бохоники
                        Бояни
                        Боярка
                        Браїлів
                        Братське
                        Брацлав
                        Брилівка
                        Брід
                        Бровари
                        Броди
                        Брошнів-Осада
                        Брусилів
                        Брюховичі
                        Буди (Харківська обл.)
                        Буки
                        Буринь
                        Бурштин
                        Буськ
                        Буча
                        Бучач
                        Буштино
                        Валки
                        Вапнярка
                        Вараш
                        Варва
                        Василівка (Запорізька обл.)
                        Васильків
                        Васильківка (Дніпропетровська обл.)
                        Ватутіне
                        Вашківці (Вижницький р-н)
                        Велика Багачка
                        Велика Березовиця
                        Велика Білозерка
                        Велика Виска (Маловисківський р-н.)
                        Велика Димерка
                        Велика Добронь
                        Велика Знам'янка
                        Велика Лепетиха
                        Велика Михайлівка
                        Велика Новосілка
                        Велика Олександрівка (Херсонська обл.)
                        Велика Писарівка
                        Велика Чернеччина
                        Великий Березний
                        Великий Бичків
                        Великий Бурлук
                        Великий Дальник
                        Великий Кучурів
                        Великий Любінь
                        Великі Бірки
                        Великі Гаї
                        Великі Копані
                        Великі Кринки (Глобинський р-н)
                        Великі Лучки
                        Великі Мости
                        Великі Сорочинці
                        Великодолинське
                        Велятин
                        Вендичани
                        Верба(Рівненська обл.)
                        Верхівцеве
                        Верхнє Водяне
                        Верхнє Синьовидне
                        Верхній Рогачик
                        Верхньодніпровськ
                        Верхня Сироватка
                        Верховина
                        Веселе (Запорізька обл.)
                        Веселинове
                        Вигода (Івано-Франківська обл)
                        Вижниця
                        Вилкове
                        Вилок (Закарпатська обл.)
                        Винники
                        Виноградів
                        Випасне (Білгород-Дністровський р-н)
                        Вири
                        Вирішальне (Лохвицький р-н)
                        Високий
                        Високопілля
                        Вишгород
                        Вишеньки
                        Вишково
                        Вишневе
                        Вишнівець
                        Війтівка
                        Війтівці (Хмельницька обл.)
                        Вільне (Криворізький р-н)
                        Вільне(Новомосковський р-н)
                        Вільногірськ
                        Вільнянськ
                        Вільшана (Черкаська обл.)
                        Вільшана(Сумська обл.)
                        Вільшани (Харківська обл.)
                        Вільшанка (Кіровоградська обл.)
                        Вінницькі Хутори
                        Вінниця
                        Віньківці
                        Власівка
                        Вовчанськ
                        Водяне (Кам'янсько-Дніпровський р-н)
                        Вознесенськ
                        Волноваха
                        Воловець
                        Володарка
                        Володимир-Волинський
                        Володимирець
                        Володимирівка (Донецька обл.)
                        Волочиськ
                        Ворзель
                        Ворожба (Білопільський р-н)
                        Вороніж
                        Вороновиця
                        Вороньків
                        Ворохта
                        Воскресенське (Миколаївська обл.)
                        Врадіївка
                        Вугледар
                        Вузлове
                        Гавришівка
                        Гадяч
                        Гайворон
                        Гайсин
                        Галич
                        Гвардійське (Дніпропетровськ)
                        Гвіздець
                        Гельмязів
                        Генічеськ
                        Геронимівка
                        Герца
                        Гірник
                        Гірське
                        Глеваха
                        Глибока
                        Глобине
                        Глухів (Сумська обл.)
                        Глухівці
                        Гнівань
                        Гніздичів
                        Гоголеве (Полтавська обл.)
                        Гоголів(Броварський р-н)
                        Гола Пристань
                        Голоби
                        Голованівськ
                        Головне
                        Голубівка
                        Гончарівське
                        Горінчово
                        Горішні Плавні
                        Горностаївка
                        Городенка
                        Городець
                        Городище (Черкаська обл.)
                        Городківка
                        Городня
                        Городок(Львівська обл.)
                        Городок(Хмельницька обл.)
                        Горохів
                        Горького
                        Гоща
                        Градизьк
                        Гребінка (Полтавська обл.)
                        Гребінки
                        Григорівка
                        Гримайлів
                        Гриців
                        Гришківці
                        Губиниха
                        Гуляйполе
                        Гусятин
                        Давидів
                        Дар'ївка
                        Дачне
                        Дашів
                        Дворічна
                        Делятин
                        Демидів
                        Демидівка
                        Деражня
                        Дергачі
                        Десна (Вінницька обл.)
                        Десна (Чернігівська обл.)
                        Джулинка (Бершадський р-н)
                        Джурин (Шаргородський р-н.)
                        Диканька
                        Димер
                        Ділове
                        Дмитрівка (Знам'янський р-н Кіровоградська обл.)
                        Дмитрівка (Чернігівська обл.)
                        Дніпро
                        Дніпровка (Запорізька обл.)
                        Дніпровське
                        Дніпрорудне
                        Добровеличківка
                        Добромиль
                        Добропілля
                        Доброслав
                        Добротвір
                        Довбиш
                        Довге (Закарпатська обл.)
                        Долина
                        Долинська
                        Долинське (Запорізький р-н)
                        Доманівка
                        Донець(Балаклійський р-н)
                        Донське
                        Дорошівка
                        Драбів
                        Драгово
                        Драчинці
                        Дрогобич
                        Дружба (Сумська обл.)
                        Дружба (Тернопільська обл.)
                        Дружківка
                        Дубляни (Львів.обл.,Жовків.р-н)
                        Дубно
                        Дубове
                        Дубровиця (Рівненська обл.)
                        Дударків
                        Дуліби
                        Дунаївці
                        Дядьковичі (Рівненський р-н)
                        Енергодар
                        Єланець
                        Єлизаветівка
                        Ємільчине
                        Єрки
                        Жашків
                        Жеребкове
                        Жидачів
                        Житомир
                        Жмеринка
                        Жовква
                        Жовті Води
                        Журавно
                        Забір'я
                        Заболотів (Снятинський р-н)
                        Заболоття (Волинська обл.)
                        Завалля (Кіровоград. обл)
                        Заводське(Лохвицький р-н,Полтав. обл)
                        Заводське(Тернопільська обл.)
                        Зазим'я
                        Залізний Порт
                        Залізці
                        Заліщики
                        Запитів
                        Запоріжжя
                        Зарванці
                        Зарічне(Рівненська обл.)
                        Заріччя(Закарпатська обл.)
                        Заставна
                        Засулля
                        Затока
                        Захарівка(Одеська обл)
                        Зачепилівка
                        Збараж
                        Зборів
                        Звенигородка
                        Згурівка
                        Здолбунів
                        Зеленогірське
                        Зеленодольськ
                        Зимна Вода
                        Зіньків
                        Злинка
                        Зміїв
                        Зміїнець
                        Знам'янка (Кіровоградська обл.)
                        Знам'янка (Одеська обл.)
                        Знам'янка Друга
                        Знаменівка (Новомосковський р-н)
                        Зноб-Новгородське
                        Зняцьово
                        Золотоноша
                        Золочів (Львівська обл.)
                        Золочів(Харківська обл.)
                        Зоря (Рівненська обл.)
                        Іваничі (Волинська обл.)
                        Іванівка (Одеська обл., Іванівський р-н)
                        Іванівка (Херсонська обл.)
                        Іванків (Іванківський р-н)
                        Іванків(Бориспільський р-н)
                        Івано-Франківськ
                        Івано-Франкове
                        Іза
                        Ізмаїл
                        Ізюм
                        Ізяслав
                        Іларіонове
                        Ілічанка
                        Іллінці
                        Іркліїв
                        Ірпінь
                        Іршава
                        Іршанськ
                        Іспас
                        Ічня
                        Кагарлик
                        Казанка
                        Каланчак
                        Калинівка (Броварський р-н)
                        Калинівка (Вінницька обл., Калинівський р-н)
                        Калинівка(Васильківський р-н.)
                        Калита
                        Калуш
                        Кам'янець-Подільський
                        Кам'янка (Черкаська обл.)
                        Кам'янка (Чернівецька обл., Глибоцький р-н)
                        Кам'янка-Бузька
                        Кам'янка-Дніпровська (Запорізька обл.)
                        Кам'янське(Дніпропетровська обл)
                        Камінь-Каширський
                        Канів
                        Карлівка
                        Карнаухівка(Дніпропетровська обл.)
                        Кароліно-Бугаз
                        Карпівка (Широківський р-н)
                        Катеринопіль
                        Каховка
                        Квасилів (Рівненська обл.)
                        Кегичівка
                        Кельменці
                        Київ
                        Кириківка(Великописарів.р-н)
                        Кирилівка(Якимівський р-н)
                        Кирнасівка
                        Кислиця
                        Ківерці
                        Ківшарівка
                        Кілія
                        Кінецьпіль
                        Кіцмань
                        Клавдієво-Тарасове
                        Клевань
                        Клесів
                        Клішківці
                        Княжичі (Броварський р-н)
                        Кобеляки
                        Коблеве
                        Ковель
                        Кодима
                        Козацьке (Херсонська обл.)
                        Козача Лопань
                        Козелець
                        Козельщина
                        Козин (Київська обл.)
                        Козин (Рівненська обл.)
                        Козова
                        Козятин
                        Колки
                        Колоденка
                        Коломак
                        Коломия
                        Колочава
                        Комар
                        Комарно
                        Комишани
                        Комишня
                        Комишуваха
                        Компаніївка
                        Конотоп
                        Копайгород
                        Копашново
                        Копилів
                        Копичинці (Гусятинський р-н)
                        Корець
                        Коритняни
                        Корнин (Житомирська обл.)
                        Королево
                        Короп
                        Коростень
                        Коростишів
                        Корсунь-Шевченківський
                        Коршів
                        Корюківка
                        Косів
                        Косонь (Косино)
                        Костопіль
                        Костянтинівка (Донецька обл.)
                        Костянтинівка(Арбузинський р-н, Микол.обл.)
                        Костянтинівка(Мелітоп.р-н,Запоріз.обл)
                        Котельва
                        Коцюбинське
                        Краковець
                        Краматорськ
                        Красилів
                        Красилівка (Броварський р-н)
                        Красне (Львівська обл.)
                        Красноград (Харківська обл)
                        Краснокутськ
                        Краснопавлівка
                        Краснопілля (Сумська обл.)
                        Красноріченське
                        Красятичі
                        Кременець
                        Кременчук
                        Кремінна
                        Криве Озеро
                        Кривий Ріг
                        Крижопіль
                        Кринички
                        Кролевець
                        Кропивницький
                        Крупець
                        Крюківщина
                        Куликів
                        Куликівка
                        Куп'янськ
                        Куп'янськ-Вузловий
                        Курахове
                        Кути (Косівський р-н)
                        Кучурган
                        Кушниця
                        Ладан
                        Ладижин
                        Ладижинка
                        Лазірки (Оржицький р-н)
                        Лазурне (Херсонська обл.)
                        Ланівці
                        Ланчин
                        Лебедин (Сумська обл.)
                        Лебедин (Черкаська обл., Шполянський р-н)
                        Леськи
                        Летичів
                        Лиман(Донецька обл)
                        Лиманське (Роздільнянський р-н)
                        Липини
                        Липова Долина
                        Липовець
                        Лиса Гора
                        Лисичанськ
                        Лисянка
                        Літин
                        Лішня
                        Лозова
                        Лозуватка(Криворізький р-н)
                        Локачі
                        Лопатин (Львівська обл.)
                        Лосинівка
                        Лохвиця
                        Лубни
                        Лугини
                        Лужани
                        Лука-Мелешківська
                        Луків
                        Луцьк
                        Львів
                        Любар
                        Любашівка
                        Любешів
                        Любимівка (Каховський р-н)
                        Люблинець
                        Любомль
                        Люботин
                        Магдалинівка
                        Майське
                        Макарів
                        Мала Білозерка
                        Мала Виска
                        Мала Данилівка
                        Малехів
                        Малин
                        Малинівка (Харківська обл.)
                        Мамаївці
                        Мамалига
                        Мангуш
                        Маневичі
                        Маньківка
                        Мар'їнка
                        Мар'янське
                        Марганець
                        Маріуполь
                        Марківка
                        Матвіївка(Вільнянський р-н)
                        Махнівка (Вінницька обл.)
                        Машівка
                        Медвеже Вушко
                        Меденичі
                        Межова
                        Мелітополь
                        Мельниця-Подільська (Тернопільська обл.)
                        Мена
                        Мерефа
                        Мигове
                        Миколаїв
                        Миколаїв (Львівська обл., Миколаївський р-н)
                        Миколаївка (Одеська обл., Миколаївський р-н)
                        Миколаївка (Петропавлівський р-н)
                        Миколаївка (Слов’янська міська рада)
                        Миколаївка(Білопільський р-н)
                        Микулинці
                        Мила
                        Минай
                        Миргород
                        Мирне(Мелітопол.р-н)
                        Мирноград
                        Миронівка
                        Миропілля(Сумська обл.)
                        Миропіль(Житомирська обл.)
                        Михайлівка (Михайлівський р-н. Запорізька обл.)
                        Михайлівка (Черкаська обл.)
                        Міжгір'я
                        Мізоч
                        Мілове
                        Містки (Сватівський р-н)
                        Мішково-Погорілове
                        Млинів
                        Могилів
                        Могилів-Подільський
                        Молодіжне
                        Молочанськ
                        Монастириська
                        Монастирище
                        Моршин
                        Мостиська
                        Мошни
                        Мукачево
                        Муровані Курилівці
                        Надвірна
                        Народичі
                        Недобоївці
                        Недригайлів (Сумська обл.)
                        Некрасове (Вінницький р-н)
                        Немирів (Вінницька обл.)
                        Немирів (Львівська обл.)
                        Немішаєве
                        Неполоківці
                        Нересниця (Тячівський р-н)
                        Нерубайське
                        Нетішин
                        Нехвороща
                        Нещеретове
                        Нива Трудова
                        Нижанковичі
                        Нижні Ворота
                        Нижні Сірогози
                        Нижні Станівці
                        Нижня Дуванка
                        Нижня Сироватка
                        Низи
                        Ніжин
                        Нікольське
                        Нікополь (Дніпропетровська обл.)
                        Нісмичі
                        Нова Борова
                        Нова Водолага
                        Нова Галещина (Козельщинський р-н)
                        Нова Збур'ївка
                        Нова Каховка
                        Нова Маячка
                        Нова Одеса
                        Нова Прага
                        Нова Ушиця
                        Новгород-Сіверський
                        Новгородка(Кіровоградська обл.)
                        Новгородське (Донецька обл.)
                        Нове
                        Новий Буг
                        Новий Калинів
                        Новий Розділ
                        Новий Стародуб
                        Новий Яричів
                        Нові Білокоровичі
                        Нові Петрівці
                        Нові Санжари
                        Новоайдар
                        Новоархангельськ
                        Новобогданівка(Запоріз.обл.)
                        Нововолинськ
                        Нововоронцовка
                        Новоград-Волинський
                        Новогродівка
                        Новогуйвинське
                        Новодністровськ
                        Новодружеськ
                        Новомиколаївка (Запорізька обл.)
                        Новомиколаївка(Скадовський р-н)
                        Новомиргород
                        Новомосковськ
                        Новоолександрівка (Нововорон.р-н,Херсон.обл.)
                        Новоолександрівка(Дніпропетровська обл.)
                        Новоолексіївка (Херсонська обл.)
                        Новопавлівка(Межівський р-н)
                        Новопокровка (Харківська обл.)
                        Новопсков
                        Новоселиця
                        Новосілки (Києво-Святошинський р-н)
                        Новотроїцьке (Донецька обл.)
                        Новотроїцьке (Херсонська обл.)
                        Новоукраїнка
                        Новояворівськ
                        Носівка
                        Обертин
                        Оболонь (Семенівський р-н)
                        Обухів
                        Обухівка
                        Овідіополь
                        Овруч
                        Одеса
                        Оженин
                        Озерне (Житомирська обл.)
                        Окни
                        Олевськ
                        Олександрівка (Миколаївська обл.)
                        Олександрівка (Олександр.р-н,Донец.обл.)
                        Олександрівка (смт.Кіровог.обл.райц)
                        Олександрія (м.Кіровогр.обл.райц)
                        Олександрія (Рівненська обл.)
                        Олексієво-Дружківка
                        Олешки(Херсонська обл)
                        Ольшанське
                        Оноківці (ст. Доманинці)
                        Онуфріївка
                        Опитне (Бахмутський р-н)
                        Опішня
                        Оратів
                        Оржиця
                        Оржів
                        Оріхів
                        Орлівщина
                        Осипенко(Бердянський р-н)
                        Остер
                        Острог
                        Острожець
                        Отинія
                        Охтирка
                        Очаків
                        Очеретине (Ясинуватський р-н)
                        П'ятихатки
                        Павлиш
                        Павлів(Львівська обл.)
                        Павлоград
                        Пантаївка
                        Панютине
                        Парафіївка
                        Партизанське (Дніпропетров.р-н)
                        Первомайськ(Микол.обл.Первомайс.р-н)
                        Первомайське(смт-Микол.обл.Вітовський.р-н)
                        Первомайський (Харківська обл.)
                        Перегінське
                        Перемишляни
                        Пересадівка
                        Перечин
                        Перещепине
                        Переяслав-Хмельницький
                        Першотравенськ (Дніпропетровська обл)
                        Першотравенськ (Житомирська обл.)
                        Петриківка
                        Петрівка-Роменська
                        Петрівське (Харківська обл.)
                        Петрове
                        Петропавлівка
                        Печеніги
                        Печеніжин
                        Пирятин
                        Південне (Харківський р-н)
                        Північне
                        Підбуж
                        Підволочиськ
                        Підгайці(Тернопільська обл.)
                        Підгорівка
                        Підгородне
                        Піски-Радьківські
                        Пісківка
                        Пісочин
                        Піщана (Одеська обл.)
                        Піщане ( Полтавська обл.)
                        Піщане(Черкаська обл.)
                        Піщаний Брід
                        Піщанка (Вінницька обл.)
                        Піщанка(Дніпропетровська обл.)
                        Побузьке
                        Погреби
                        Погребище
                        Подільськ
                        Покотилівка
                        Покров (Дніпропетровська обл.)
                        Покровськ (Донецька обл.)
                        Покровське (Покровський р-н Дніпропетровська обл.)
                        Полігон
                        Пологи
                        Полонне
                        Полтава
                        Поляна (Закарпатська обл.)
                        Поляниця (Буковель)
                        Помічна
                        Понінка
                        Понорниця
                        Попасна
                        Попільня
                        Почаїв
                        Преображенка (Каланчацький р-н)
                        Приазовське
                        Прилуки
                        Приморськ (Запорізька обл.)
                        Приютівка (Кіровоградська обл.)
                        Проліски
                        Просяна (Покровський р-н)
                        Пулини
                        Пустомити
                        Путивль
                        Путила
                        Рава-Руська
                        Радехів
                        Радивилів
                        Радомишль
                        Радушне
                        Райгородка
                        Райгородок(Слов'янський р-н)
                        Райське(Херсонська обл.)
                        Ракошино
                        Ралівка
                        Ратне
                        Рафалівка
                        Рахів
                        Рахни-Лісові
                        Ременів
                        Рені
                        Решетилівка
                        Ржищів
                        Рикове
                        Рівне
                        Рівне (Новоукраїнський р-н Кіровоградська обл.)
                        Ріпки
                        Рогань(Велика Рогань)
                        Рогатин
                        Родинське
                        Рожище
                        Рожнятів
                        Роздільна (Одеська обл.)
                        Розівка (Розівський р-н)
                        Розсошенці(Полтавська обл.)
                        Розтоки
                        Рокитне (Київська обл., Рокитнянський р-н)
                        Рокитне (Рівненська обл., Рокитнівський р-н)
                        Романів
                        Романківці
                        Ромни
                        Ромодан
                        Рубанівка
                        Рубіжне
                        Рудки
                        Ружин
                        Руська Лозова
                        Руська Поляна
                        Рясне-Руське
                        Саврань
                        Сагунівка
                        Самбір
                        Сарата
                        Сарни
                        Сартана (Донецька обл.)
                        Сахновщина
                        Свалява
                        Сватове
                        Свеса
                        Світловодськ
                        Світлодарськ
                        Святогірськ
                        Святопетрівське (Києво-Свят.р-н)
                        Селидове
                        Семенівка(Полт.обл., Семенів.р-н)
                        Семенівка(Чернігівська обл.)
                        Сенча
                        Сергіївка (Білгород-Дністровський р-н)
                        Серебрія
                        Середина-Буда
                        Середнє
                        Середнє Водяне
                        Сєвєродонецьк
                        Сиваське
                        Сигнаївка
                        Синельникове
                        Ситківці
                        Сіверськ
                        Сінгури
                        Скадовськ
                        Скала-Подільська
                        Скалат
                        Сквира
                        Сколе
                        Скороходове (Полтавська обл.)
                        Славське (Львівська обл.)
                        Славута
                        Славутич
                        Слатине
                        Слобожанське(Зміївський р-н., Харківська обл.)
                        Слов'янськ
                        Словечне
                        Смига
                        Сміла
                        Смоліне
                        Снігурівка
                        Сновськ
                        Снятин
                        Сокаль
                        Сокирниця (Хуст.р-н,Закарпатська обл.)
                        Сокиряни
                        Сокільники
                        Соколівка
                        Соледар
                        Солоне
                        Солоницівка
                        Солонка (Львівська обл.)
                        Солотвино
                        Сосниця
                        Соснівка (Львівська обл.)
                        Софіївка(Дніпропетровська обл.)
                        Сошичне
                        Срібне
                        Ставище
                        Станиця Луганська
                        Стара Вижівка
                        Стара Синява
                        Стара Ушиця
                        Старий Крим (Донецька обл.)
                        Старий Остропіль
                        Старий Самбір
                        Старобільськ
                        Старовойтове
                        Старокозаче
                        Старокостянтинів
                        Старомлинівка
                        Стасі
                        Стеблів (Черкаська обл.)
                        Стеблівка
                        Стебник
                        Степанівка (Сумська обл.)
                        Степань
                        Стецьківка
                        Сторожинець
                        Сторожниця(Ужгородський р-н)
                        Стоянів (Львівська обл.)
                        Стоянка
                        Страбичово
                        Стрижавка
                        Стрий
                        Стрілки
                        Струмівка
                        Стуфчинці
                        Суботці
                        Судилків
                        Судова Вишня
                        Суми
                        Сурсько-Литовське
                        Сутиски
                        Східниця
                        Таврійськ (Херсонська обл.)
                        Таврійське (Голопристанський р-н)
                        Таїрове
                        Талаківка
                        Талалаївка
                        Тальне
                        Тальянки
                        Таранівка
                        Тарасівка
                        Тараща
                        Тарутине
                        Татарбунари
                        Теофіполь
                        Теплик
                        Теплодар
                        Теребовля
                        Тересва
                        Терешки (Полтавський р-н)
                        Терни
                        Тернівка
                        Тернопіль
                        Терпіння
                        Тетіїв
                        Тиврів
                        Тинне
                        Тисмениця
                        Тишківка
                        Тлумач
                        Товсте
                        Токмак
                        Томаківка
                        Томашгород
                        Томашпіль
                        Торецьк
                        Торчин
                        Требухів
                        Трипілля (Київська обл.)
                        Троїцьке (Луганська обл.)
                        Троїцьке (Одеська обл.Біляївський р-н)
                        Тростянець (Вінницька обл.)
                        Тростянець (Сумська обл.)
                        Трускавець
                        Тульчин
                        Турбів
                        Турійськ
                        Турка
                        Тучин
                        Тячів
                        Угля
                        Угринів
                        Ужгород
                        Узин
                        Українка
                        Українськ (Донецька обл.)
                        Уланів
                        Умань
                        Устилуг
                        Устинівка
                        Фастів
                        Фонтанка
                        Харків
                        Хацьки
                        Херсон
                        Хирів
                        Хмельницький
                        Хмельове (Кіровоградська обл.)
                        Хмільник (Вінницька обл.)
                        Ходорів
                        Хорол
                        Хоростків
                        Хорошів
                        Хотин
                        Хотів
                        Хотінь
                        Христинівка
                        Хуст
                        Царичанка
                        Цебрикове
                        Цекинівка
                        Цибулів
                        Циркуни
                        Цумань
                        Чабани
                        Чайки
                        Чаплине
                        Чаплинка (Херсонска обл.)
                        Часів Яр
                        Чемерівці
                        Червона Кам'янка
                        Червона Слобода
                        Червоне (Житомирська обл.)
                        Червоноград (Львівська обл.)
                        Черкаси
                        Черкаське
                        Чернівці
                        Чернівці(Вінницька обл.)
                        Чернігів
                        Чернігівка
                        Черніїв
                        Чернятин (Жмеринський р-н)
                        Черняхів (Житомирська обл.)
                        Чечельник
                        Чигирин
                        Чинадійово
                        Чкалове (Новотроїцький р-н, Херсонська обл.)
                        Чкаловське
                        Чонгар(Херсонська обл.)
                        Чоп
                        Чорний Острів
                        Чорнобаївка
                        Чорнобай
                        Чорноморськ
                        Чорнухи (Полтавська обл.)
                        Чортків
                        Чугуїв
                        Чудей
                        Чуднів
                        Чутове
                        Шабо
                        Шаргород (Вінницька обл.)
                        Шацьк
                        Шаян
                        Шевченкове (Кілійський р-н)
                        Шевченкове (Харківська обл.)
                        Шевченкове (Черкаська обл.)
                        Шегині
                        Шепетівка
                        Шипинці
                        Широке (Широківський р-н)
                        Ширяєве
                        Шишаки
                        Шостка
                        Шпола
                        Шумськ
                        Щасливе
                        Щастя
                        Щирець
                        Южне
                        Южноукраїнськ
                        Юр'ївка
                        Яблунів
                        Яворів
                        Яготин
                        Якимівка (Запорізька обл.)
                        Якушинці
                        Ялта (Донецька обл.)
                        Ямпіль (Вінницька обл.)
                        Ямпіль (Сумська обл.)
                        Ямпіль (Хмельницька обл.)
                        Яремче
                        Яреськи
                        Ярмолинці
                        Ясенів-Пільний
                        Ясіня"
        ;

        $cities_ru = explode("\n",$cities);
        $cities_ua = explode("\n",$cities_uaq);
        for ($i = 0 ; $i<count($cities_ru) ;$i++){
            Cities::create([ 'city_ua'=> trim($cities_ua[$i]), 'city_ru' => trim($cities_ru[$i]) ]);

        }

    }

}